Repository: stefanmm/woocommerce-extra-consent
Catalog: languages/woocommerce-extra-consent-*.po
Languages: hr, mk_mk

source: I agree to be contacted
hr: Slažem se da me kontaktirate
mk_mk: Се согласувам да бидам контактиран

source: You must agree to the consent to proceed with the purchase.
hr: Za nastavak kupnje morate da date dodatnu suglasnost.
mk_mk: Мора да се согласите со правилото пред да продолжите кон плаќање.

source: Extra Consent
hr: Dodatna Suglasnost
mk_mk: Дополнителна Согласност

source: Uncontacted Clients
hr: Nekontaktirani kupci
mk_mk: Неконтактирани купувачи

source: Contacted Clients
hr: Kontaktirani kupci
mk_mk: Контактирани купувачи

source: Settings
hr: Postavke
mk_mk: Поставки

source: Extra Consent Settings
hr: Dodatna Suglasnost - postavke
mk_mk: Дополнителна Согласност - поставки

source: Extra Consent is an plugin that allows you to display an additional consent request on the Checkout page (for example for Viber membership, WhatsApp group or similar).<br>In Settings you can: set the text of the consent you are looking for; to determine whether the request will be mandatory or not (initially it is set to NOT be mandatory, but if you decide that it is mandatory then it will not be possible to proceed to payment until consent is given); to set an error message that will appear if the user has not given consent (appears only if the request is mandatory).<br>If the buyer agrees, then his data is automatically filled in the Uncontacted table. And when a buyer is contacted (or added to a group or otherwise processed) then just click on the checkbox next to his data and he will automatically move to the Contacted table.<br>Both tables also show the agreement that they entered into, so that if the text of the agreement you are looking are changed, you can know what the buyer agreed to.<br>If the user's email is already registered in the plugin database, then this additional field will no longer be displayed.
hr: Dodatna Suglasnost je dodatak koji vam omogućuje prikaz dodatnog zahtjeva za privolu na stranici Naplate (primjerice za Viber članstvo, WhatsApp grupu ili slično).<br>U Postavkama možete: postaviti tekst privole koji tražite; za određivanje hoće li zahtjev biti obvezan ili ne (u početku je postavljeno da NE bude obvezan, ali ako odlučite da je obvezan tada neće biti moguće nastaviti s plaćanjem dok se ne da suglasnost); za postavljanje poruke o pogrešci koja će se pojaviti ako korisnik nije dao privolu (pojavljuje se samo ako je zahtjev obavezan).<br>Ako je kupac suglasan, tada se njegovi podaci automatski popunjavaju u tablici Nekontaktirani. A kada je kupac kontaktiran (ili dodan u grupu ili na neki drugi način obrađen) tada samo kliknite na potvrdni okvir pored njegovih podataka i on će se automatski prebaciti u tablicu Kontaktirani.<br>Obje tablice također pokazuju suglasnost koji su prihvatili, tako da ako se promijeni tekst suglasnosti koji tražite, možete znati na što je kupac pristao.<br>Ako je korisnikova adresa e-pošte već registrirana u bazi podataka ovog dodatka, tada ovo dodatno polje više neće biti prikazano.
mk_mk: Дополнителна Согласност е додавка која ви овозможува на страницата за Наплата да прикажете дополнително барање согласност (на пример за членство во Вибер, Вацап група или слично).<br>Во Поставки можете: да го поставите текстот на согласноста која ја барате; да одредите дали барањето ќе биде задолжително или не (во старт е поставено да не е задолжително, но ако одлучите да е задолжително тогаш нема да може да се продолжи кон плаќање додека не се даде согласност); да поставите порака за грешка која ќе се појави ако корисникот не дал согласност (се појавува само ако барањето е задолжително).<br>Ако се согласи купувачот, тогаш неговите податоци автоматски се пополнуваат во табелата Неконтактирани. А кога некој купувач ќе биде контактиран (или додаден во група или на друг начин обработен) тогаш само кликнете на чекбоксот покрај неговите податоци и тој автоматски ќе се префрли во табелата Контактирани.<br>И во двете табели се прикажува и согласноста на која се нафатиле, за да може ако се менува текстот на согласноста која ја барате, да се знае на што се согласил кој купувач.<br>Ако мејлот на корисникот е веќе запишан во базата на податоци за додавкава, тогаш нема да му се прикаже веќе ова дополнително поле.

source: Main Settings
hr: Glavne postavke
mk_mk: Главни поставки

source: Consent Text
hr: Tekst pristanka
mk_mk: Текст на барањето согласност

source: Is Consent Required?
hr: Je li pristanak obavezan?
mk_mk: Дали е барањето задолжително?

source: Custom Error Message
hr: Prilagođena poruka o pogrešci
mk_mk: Порака која би се прикажала ако не се прифати задолжителното барање

source: First Name
hr: Ime
mk_mk: Име

source: Last Name
hr: Prezime
mk_mk: Презиме

source: Email
mk_mk: Е-пошта

source: Phone
hr: Telefon
mk_mk: Телефон

source: Consent Message
hr: Poruka o pristanku
mk_mk: Прифатена согласност

source: Contacted
hr: Kontaktiran
mk_mk: Контактиран
